/* add card section - section title
consent section - add a new card */
"Add new" = "เพิ่มใหม่";

"Apple Pay" = "Apple Pay";

/* title for bank selection */
"Bank" = "ธนาคาร";

/* Billing Address - title */
"Billing Address" = "ที่อยู่สำหรับออกใบเสร็จ";

/* add card section - billing info */
"Billing country or region" = "ประเทศหรือภูมิภาคสำหรับออกใบเสร็จ";

"Card" = "บัตร";

/* consent section - alert cancel button to delete a consent */
"Cancel" = "ยกเลิก";

/* Card Info Cell - title */
"Card Information" = "ข้อมูลบัตร";

/* user input validation */
"Card’s expiration date is invalid" = "วันหมดอายุของบัตรไม่ถูกต้อง";

/* consent section - unselect consent and go back to consent list */
"Change" = "เปลี่ยน";

/* consent section - choose a saved card */
"Choose a card" = "เลือกบัตร";

/* billing city placeholder */
"City" = "เมือง";

/* close button for alert */
"Close" = "ปิด";

/* checkout button title for recurring payment */
"Confirm" = "ยืนยัน";

/* consent section - cvc field placeholder
user input - cvc placeholder */
"CVC" = "CVC";

/* add card section - billing field */
"Email" = "อีเมล";

/* user input validation */
"Expiry date is required" = "ต้องกรอกวันหมดอายุ";

/* add card section - UnionPay warning message */
"For UnionPay, only credit cards can be saved. Click “Pay” to proceed with a one time payment or use another card if you would like to save it for future use." = "สำหรับ UnionPay สามารถบันทึกเฉพาะบัตรเครดิตเท่านั้น คลิก “ชำระเงิน” เพื่อทำรายการครั้งเดียว หรือใช้บัตรอื่นหากคุณต้องการบันทึกสำหรับการใช้ในอนาคต";

/* user input validation */
"Invalid email" = "อีเมลไม่ถูกต้อง";

/* user input validation */
"Invalid phone number" = "เบอร์โทรศัพท์ไม่ถูกต้อง";

/* schema section - invalid schema data */
"Invalid schema" = "รูปแบบไม่ถูกต้อง";

/* user input validation */
"Invalid state" = "รัฐ / จังหวัดไม่ถูกต้อง";

/* add card section - button to switch to consent list */
"Keep using saved cards" = "ใช้บัตรที่บันทึกไว้ต่อไป";

/* add card section - billing field */
"Name on card" = "ชื่อบนบัตร";

/* payment section separator */
"Or pay with" = "หรือชำระด้วย";

/* checkout button title for one-off payment */
"Pay" = "ชำระเงิน";

/* title for payment sheet */
"Payment Methods" = "วิธีการชำระเงิน";

/* add card section - billing field */
"Phone number" = "เบอร์โทรศัพท์";

/* user input validation */
"Please enter your city" = "กรุณากรอกชื่อเมืองของคุณ";

/* country selection view error hint
user input validation */
"Please enter your country" = "กรุณากรอกประเทศของคุณ";

/* user input validation */
"Please enter your first name" = "กรุณากรอกชื่อจริงของคุณ";

/* user input validation */
"Please enter your last name" = "กรุณากรอกนามสกุลของคุณ";

/* user input validation */
"Please enter your name on card" = "กรุณากรอกชื่อบนบัตรของคุณ";

/* user input validation */
"Please enter your street" = "กรุณากรอกชื่อถนน";

/* user input validation - bank selection view error hint */
"Please select a bank" = "กรุณาเลือกธนาคาร";

/* billing postal code placeholder */
"Postal code" = "รหัสไปรษณีย์";

/* consent section - alert confirm button to remove a consent */
"Remove" = "ลบ";

/* consent section - alert title for delete a consent */
"Remove %@?" = "ลบ %@ หรือไม่?";

/* Billing Address - reuse toggle */
"Same as shipping address" = "เหมือนที่อยู่สำหรับจัดส่ง";

/* add card section - toggle for card saving */
"Save my card for future payments" = "บันทึกบัตรของฉันสำหรับการชำระเงินในอนาคต";

/* schema section - title of Bank Selection form */
"Select your Bank" = "เลือกธนาคารของคุณ";

/* bank selection placeholder
country selection view placeholder */
"Select..." = "เลือก...";

/* billing state placeholder */
"State" = "รัฐ / จังหวัด";

/* billing street placeholder */
"Street" = "ถนน";

/* consent section - alert message for delete a consent */
"This option will be permanently removed from your saved payment methods." = "ตัวเลือกนี้จะถูกลบออกจากวิธีการชำระเงินที่บันทึกไว้ของคุณอย่างถาวร";

/* alert message for delete MIT consent */
"This card is used for other payments you've set up with %@. Please contact %@ to update the payment method for these payments before removing this card." = "บัตรนี้ถูกใช้สำหรับการชำระเงินอื่น ๆ ที่คุณตั้งค่ากับ %@ กรุณาติดต่อ %@ เพื่ออัปเดตวิธีการชำระเงินสำหรับการชำระเงินเหล่านี้ก่อนที่จะลบบัตรนี้";

/* schema payment redirect reminder */
"You will be redirected to complete your payment upon confirmation." = "คุณจะถูกเปลี่ยนเส้นทางไปหน้าชำระเงินเมื่อยืนยัน";


/* Apple Pay section - instruction text */
"Click the Apple Pay button below to securely complete your purchase." = "คลิกปุ่ม Apple Pay ด้านล่างเพื่อทำการซื้อให้เสร็จสมบูรณ์อย่างปลอดภัย";


/* billing state placeholder */
"Area" = "เขตพื้นที่";

/* billing state placeholder */
"County" = "เคาน์ตี";

/* billing state placeholder */
"Department" = "ดีพาร์ตเมนต์";

/* billing state/city placeholder */
"District" = "เขต";

/* billing state placeholder */
"Do Si" = "โด-ซี";

/* billing postal code placeholder */
"Eircode" = "Eircode";

/* billing state placeholder */
"Emirate" = "เอมิเรต";

/* billing state placeholder */
"Island" = "เกาะ";

/* billing state placeholder */
"Oblast" = "แคว้น";

/* billing state placeholder */
"Parish" = "แพริช";

/* billing postal code placeholder */
"Pin" = "Pin";

/* billing state placeholder */
"Prefecture" = "จังหวัด (Prefecture)";

/* billing state placeholder */
"Province" = "จังหวัด";

/* billing city placeholder */
"Suburb" = "ชานเมือง";

/* billing city placeholder */
"Town" = "เมือง";

/* billing postal code placeholder */
"ZIP code" = "รหัสไปรษณีย์ ZIP";

/* RegexInputValidator - shown when a required field is left empty */
"Required" = "จำเป็น";

/* RegexInputValidator - shown when input does not match its expected format */
"Please enter a valid value" = "กรุณาป้อนค่าที่ถูกต้อง";
